
s = {1}
for a in range(2, 101):
    tmp = a
    now = 0
    for b in range(2, 101):
        tmp *= a
        if tmp in s:
            pass
        else:
            now += 1
            s.add(tmp)
    print(a, now)
print(len(s))
'''2   4    8    16   32   64 //这些数都是从2到10平方到4次方之后可能会重复的数，当他们各自以相同的n次方后就会相同的，
3   9    27   81           //比如25^2到50次方都与(2^2)^2到50次方都相同，故相同的有49个
5   25
6   36
7   49
10  100

所以这些数相同的有：

4 --> 49 
8 --> 49 
9 --> 49 
16 --> 58 
25 --> 49
27 --> 49 
32 --> 48 
36 --> 49 
49 --> 49 
64 --> 62 
81 --> 58 
100 --> 49 总共有 618 个重复的。

所以答案为：99*99-618=9183'''
